# PipeFittingAndAccessoryPressureDropUIDataItem Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeFittingAndAccessoryPressureDropUIDataItem Class
Members See Also
---
The input and output data used by external UI servers for initializing and storing the UI settings.
**Namespace:** Autodesk.Revit.UI.Plumbing**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class PipeFittingAndAccessoryPressureDropUIDataItem : IDisposable
```

Visual Basic
---
```text
Public Class PipeFittingAndAccessoryPressureDropUIDataItem _
	Implements IDisposable
```

Visual C++
---
```text
public ref class PipeFittingAndAccessoryPressureDropUIDataItem : IDisposable
```

# Remarks
One family instance has one UI data item. The UI data item contains a corresponding PipeFittingAndAccessoryData which is used for initialing the UI settings and an entity which is used for storing the UI settings.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.UI.Plumbing..::..PipeFittingAndAccessoryPressureDropUIDataItem
# See Also
PipeFittingAndAccessoryPressureDropUIDataItem Members
Autodesk.Revit.UI.Plumbing Namespace